tests/performance-tests.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 120
      arrivalRate: 50
      name: "Spike test"
    - duration: 60
      arrivalRate: 5
      name: "Ramp down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"

  - name: "Get Parking Spots"
    weight: 40
    flow:
      - get:
          url: "/api/parking/spots"
          qs:
            lat: 54.3520
            lng: 18.6466
            radius: 1000

  - name: "Search Parking Spots"
    weight: 30
    flow:
      - get:
          url: "/api/parking/search"
          qs:
            query: "Gdansk"
            lat: 54.3520
            lng: 18.6466

  - name: "Get Specific Parking Spot"
    weight: 20
    flow:
      - get:
          url: "/api/parking/spots/1"